app/Controllers/Auth.php

            ];

            $usersModel = new \App\Models\UsersModel();
            $query = $usersModel->insert($values);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('test', 'test@test.com', '$2y$10$x2ARZH77oOR6ravbdS91OeyyhdQQtEg/1Ur8XFfwfPn2u9LIECa6O')

    function check(){
        $validation = $this->validate([
            'email' => [
                'rules' => 'required|valid_email|is_not_unique[users.email]',
                'errors' => [
                    'required' => 'Email is required.',
                    'valid_email' => 'Enter a valid email adress.',
                    'is_not_unique' => 'This email is not registred on our service.'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[5]|max_length[12]',
                'errors' => [
                    'required' => 'Password is required.',
                    'min_length' => 'Password must have atleast 5 characters.',
                    'max_length' => 'Password must not have more than 12 characters.'
                ]
            ]
        ]);

        if(!$validation){
            return view('auth/login',['validation'=>$this->validator]);
        }else{
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $usersModel = new \App\Models\UsersModel();
            $user_info = $usersModel->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'test@test.com'
 LIMIT 1